In [1]:
import pandas as pd
import numpy as np

In [2]:
d1= {
    'Student':["Dinesh",'Jaison','Kamlesh'],
    'USN':[101,102,103]
}

In [3]:
df=pd.DataFrame(d1)

In [4]:
print(df)

   Student  USN
0   Dinesh  101
1   Jaison  102
2  Kamlesh  103

In [5]:
d2={
    'c1':[1,2,3],
    'c2':[40,5,60]
}
d3={
    'c2':[4,5,6],
    'c4':[70,80,90]
}
d4={
    'c5':[7,8,9],
    'c6':[100,110,120]
}

In [6]:
df1=pd.DataFrame(d2)

In [7]:
df1

   c1  c2
0   1  40
1   2   5
2   3  60

In [8]:
df2=pd.DataFrame(d3)
df2

   c2  c4
0   4  70
1   5  80
2   6  90

In [9]:
pd.concat([df1,df2])

    c1  c2    c4
0  1.0  40   NaN
1  2.0   5   NaN
2  3.0  60   NaN
0  NaN   4  70.0
1  NaN   5  80.0
2  NaN   6  90.0

In [10]:
df4=pd.merge(df1,df2,how='inner', on='c2')

In [11]:
df4

   c1  c2  c4
0   2   5  80

In [12]:
# Create a dataframe with the help of inner join return 3 rows

In [13]:
e1={
    'student':['kamlesh','jaison','kamlesh','dinesh'],
    'usn':[11,22,33,44]
}
e2={
    'usn':[11,22,33],
    'marks':[56,57,58]
}

In [14]:
df5=pd.DataFrame(e1)
df6=pd.DataFrame(e2)

In [15]:
df5

   student  usn
0  kamlesh   11
1   jaison   22
2  kamlesh   33
3   dinesh   44

In [16]:
df6

   usn  marks
0   11     56
1   22     57
2   33     58

In [23]:
df7=pd.merge(df5,df6,how='left', on='usn')

In [24]:
df7

   student  usn  marks
0  kamlesh   11   56.0
1   jaison   22   57.0
2  kamlesh   33   58.0
3   dinesh   44    NaN